# EyePosition Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewOrientation3D..::..EyePosition Property
ViewOrientation3D Class See Also
---
The eye position point
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public XYZ EyePosition { get; }
```

Visual Basic
---
```text
Public ReadOnly Property EyePosition As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ EyePosition {
	XYZ^ get ();
}
```

# See Also
ViewOrientation3D Class
Autodesk.Revit.DB Namespace